## Plan Result (prod_mgmt)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.additional_policies[&#34;cf408942-3215-4a3a-bdf2-e703c688bc13&#34;]
  * module.data_mgmt_zone.azurerm_purview_account.this[0]
* Replace
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.purview
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;account&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;blob&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;namespace&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;portal&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;queue&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.additional_policies["cf408942-3215-4a3a-bdf2-e703c688bc13"] will be created
  + resource "azurerm_key_vault_access_policy" "additional_policies" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.KeyVault/vaults/ingest-mgmt-kv-prod"
      + object_id               = "cf408942-3215-4a3a-bdf2-e703c688bc13"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "a913dbc1-9af9-4078-a8f4-c1790102fa0c"
    }

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.purview must be replaced
-/+ resource "azurerm_key_vault_access_policy" "purview" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.KeyVault/vaults/ingest-mgmt-kv-prod/objectId/502f8c83-7b19-4abc-bd6d-0487cfdce87a" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "502f8c83-7b19-4abc-bd6d-0487cfdce87a" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["account"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-account-prod" -> (known after apply)
        name                     = "ingest-mgmt-purview-endpoint-account-prod"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/networkInterfaces/ingest-mgmt-purview-endpoint-account-prod.nic.17e2a829-946c-4ecd-a673-c5e00a9c1308"
              - name = "ingest-mgmt-purview-endpoint-account-prod.nic.17e2a829-946c-4ecd-a673-c5e00a9c1308"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-account-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.purview.azure.com"
              - name                = "privatelink.purview.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-account-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest-mgmt-purview-endpoint-account-connection-prod"
          ~ private_connection_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-prod" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.0.6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["blob"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-blob-prod" -> (known after apply)
        name                     = "ingest-mgmt-purview-endpoint-blob-prod"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/networkInterfaces/ingest-mgmt-purview-endpoint-blob-prod.nic.8bd79cd5-f3dd-4278-a510-cafb05fa5b7e"
              - name = "ingest-mgmt-purview-endpoint-blob-prod.nic.8bd79cd5-f3dd-4278-a510-cafb05fa5b7e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-blob-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-blob-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest-mgmt-purview-endpoint-blob-connection-prod"
          ~ private_connection_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod/providers/Microsoft.Storage/storageAccounts/scanuksouthmclwtfl" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.0.8" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["namespace"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-namespace-prod" -> (known after apply)
        name                     = "ingest-mgmt-purview-endpoint-namespace-prod"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/networkInterfaces/ingest-mgmt-purview-endpoint-namespace-prod.nic.9765130c-1a58-4f76-9715-b0f7a5d9f939"
              - name = "ingest-mgmt-purview-endpoint-namespace-prod.nic.9765130c-1a58-4f76-9715-b0f7a5d9f939"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-namespace-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.servicebus.windows.net"
              - name                = "privatelink.servicebus.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-namespace-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest-mgmt-purview-endpoint-namespace-connection-prod"
          ~ private_connection_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod/providers/Microsoft.EventHub/namespaces/Atlas-8be0ad7e-09d1-4b53-a27c-be3b101c6854" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.0.10" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["portal"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-portal-prod" -> (known after apply)
        name                     = "ingest-mgmt-purview-endpoint-portal-prod"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/networkInterfaces/ingest-mgmt-purview-endpoint-portal-prod.nic.faadc6ff-5c62-48c1-a438-4ce487539a54"
              - name = "ingest-mgmt-purview-endpoint-portal-prod.nic.faadc6ff-5c62-48c1-a438-4ce487539a54"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-portal-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.purview.azure.com"
              - name                = "privatelink.purview.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-portal-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest-mgmt-purview-endpoint-portal-connection-prod"
          ~ private_connection_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-prod" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.0.9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["queue"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-queue-prod" -> (known after apply)
        name                     = "ingest-mgmt-purview-endpoint-queue-prod"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/networkInterfaces/ingest-mgmt-purview-endpoint-queue-prod.nic.69efd0bc-52f9-4924-a67a-67ec2f973c76"
              - name = "ingest-mgmt-purview-endpoint-queue-prod.nic.69efd0bc-52f9-4924-a67a-67ec2f973c76"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-queue-prod/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/privateEndpoints/ingest-mgmt-purview-endpoint-queue-prod/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ingest-mgmt-purview-endpoint-queue-connection-prod"
          ~ private_connection_resource_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod/providers/Microsoft.Storage/storageAccounts/scanuksouthmclwtfl" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.247.0.7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_purview_account.this[0] will be created
  + resource "azurerm_purview_account" "this" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "uksouth"
      + managed_resource_group_name                      = "ingest-mgmt-purview-prod"
      + managed_resources                                = (known after apply)
      + name                                             = "ingest-mgmt-purview-prod"
      + public_network_enabled                           = false
      + resource_group_name                              = "ingest-mgmt-rg-prod"
      + scan_endpoint                                    = (known after apply)
      + tags                                             = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 8 to add, 0 to change, 6 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_mgmt_zone.azurerm_purview_account.this[0] has been deleted
  - resource "azurerm_purview_account" "this" {
      - id                                               = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-prod" -> null
      - managed_resources                                = [
          - {
              - event_hub_namespace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod/providers/Microsoft.EventHub/namespaces/Atlas-8be0ad7e-09d1-4b53-a27c-be3b101c6854"
              - resource_group_id      = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod"
              - storage_account_id     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-purview-prod/providers/Microsoft.Storage/storageAccounts/scanuksouthmclwtfl"
            },
        ] -> null
        name                                             = "ingest-mgmt-purview-prod"
        tags                                             = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)

      - identity {
          - principal_id = "502f8c83-7b19-4abc-bd6d-0487cfdce87a" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            # (2 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"prod_mgmt","Vars":{}} -->